JoseAmador95/stm32f401re/src/stm32f401-i2c-driver.c
#include "stm32f401-i2c-driver.h"
#include "assert.h"

#define MILLISECONDS 1000
#define MICROSECONDS (1000 * MILLISECONDS)
#define NANOSECONDS (1000 * MICROSECONDS)

/**
 * @brief Blocks the thread until the I2C SR flag is set
 * @param[in] pI2Cx Pointer to I2C peripheral
 * @para[in] flag I2C Status Register flags from I2C_STATUS_FLAGS
 */
#define I2C_Wait_For_Flag(pI2Cx, flag) while (!I2C_Get_Flag_Status(pI2Cx, flag))

/**
 * @brief Max SCL rise time
 * @note Units are nanoseconds
 */
enum I2C_MAX_TRISE
{
    I2C_MAX_TRISE_SM = 1000,
    I2C_MAX_TRISE_FM = 300
};

/**
 * @brief I2C status flags from SR1 and SR2
 */
typedef enum I2C_STATUS_FLAGS
{
    I2C_FLAG_SB,
    I2C_FLAG_ADDR,
    I2C_FLAG_BTF,
    I2C_FLAG_ADD10,
    I2C_FLAG_STOPF,
    I2C_FLAG_RXNE,
    I2C_FLAG_TXE,
    I2C_FLAG_MSL,
    I2C_FLAG_BUSY,
    I2C_FLAG_TRA,
    I2C_FLAG_GEN_CALL,
    I2C_FLAG_SMBDE_FAULT,
    I2C_FLAG_SMB_HOST,
    I2C_FLAG_DUALF,
    I2C_FLAG_PEC
} I2C_STATUS_FLAGS;

/**
 * @brief I2C error flags from SR1
 */
typedef enum I2C_ERROR_FLAGS
{
    I2C_ERROR_BERR = 8,
    I2C_ERROR_ARLO = 9,
    I2C_ERROR_AF = 10,
    I2C_ERROR_OVR = 11,
    I2C_ERROR_PECERR = 12,
    I2C_ERROR_TIMEOUT = 14,
    I2C_ERROR_SMBALERT = 15
} I2C_ERROR_FLAGS;

/**
 * @brief Generate the I2C start condition
 * @param[in] pI2Cx I2C peripheral base address
 */
static void I2C_Generate_Start_Condition(typedef_I2C_t *pI2Cx);

/**
 * @brief Generate the I2C stop condition
 * @param[in] pI2Cx I2C peripheral base address
 */
static void I2C_Generate_Stop_Condition(typedef_I2C_t *pI2Cx);

/**
 * @brief Get I2C flag status from the Status Registers
 * @param[in] pI2Cx I2C peripheral base address
 * @param[in] flag I2C flag from SR1 & SR2
 */
static uint8_t I2C_Get_Flag_Status(typedef_I2C_t *pI2Cx, I2C_STATUS_FLAGS flag);

/**
 * @brief Get the value for the TRISE register
 * @param[in] scl_freq I2C SCL frequency
 */
static uint8_t I2C_TRISE_Max(uint32_t scl_freq);

/**
 * @brief Set the clock control register bits
 * @param[in] apb_freq APB1 Clock frequency
 * @param[in] scl_freq Target SCL frequency
 * @param[in] dc Duty-cycle for Fast mode
 */
static uint16_t I2C_CCR(uint8_t apb_freq, uint32_t scl_freq, I2C_FM_DC dc);

/**
 * @brief Get the role of the device (Master/Slave)
 * @param[in] pI2Cx Pointer to I2C peripheral
 * @return Returns an I2C_ROLE macro
 */
static I2C_ROLE I2C_Get_Device_Role(typedef_I2C_t *pI2Cx);

/**
 * @brief Triggers the I2C address phase
 * @param[in] pI2Cx Pointer to I2C peripheral
 * @param[in] slave_address Address of the slave device
 * @param[in] rw Operation to perform (Read from slave or Write to slave)
 * @details The address phase is when the I2C master sends the address and 
 *          operation to perform in the I2C bus. 
 */
static void I2C_Address_Phase(typedef_I2C_t *pI2Cx, uint16_t slave_address,
                              RW rw);

/**
 * @brief Clears the ADDR bit in the ADDR bit in Status Register 1
 * @param[in] pI2CHandle Pointer to a I2C handle
 */
static void I2C_Clear_ADDR_Flag(I2C_Handle_t *pI2CHandle);

static uint8_t I2C_Get_Error_Status(typedef_I2C_t *pI2Cx, I2C_ERROR_FLAGS flag);
void I2C_Application_EV_Callback(I2C_Handle_t *pI2CHandle, I2C_APP flag);

void I2C_PeriClockControl(typedef_I2C_t *pI2Cx, uint8_t status)
{
    if (status == ENABLE)
    {
        if (pI2Cx == I2C1)
        {
            I2C1_PCLK_EN();
        }
        else if (pI2Cx == I2C2)
        {
            I2C2_PCLK_EN();
        }
        else if (pI2Cx == I2C3)
        {
            I2C3_PCLK_EN();
        }
    }
    else if (status == DISABLE)
    {
        if (pI2Cx == I2C1)
        {
            I2C1_PCLK_DI();
        }
        else if (pI2Cx == I2C2)
        {
            I2C2_PCLK_DI();
        }
        else if (pI2Cx == I2C3)
        {
            I2C3_PCLK_DI();
        }
    }
}

void I2C_Init(I2C_Handle_t *pI2CHandle)
{
    // Enable the peripheral clock
    I2C_PeriClockControl(pI2CHandle->pI2Cx, ENABLE);

    // Get the APB1 clock frequency
    uint8_t freq = RCC_get_apb1_freq() / 1000000;

    // Assert invalid values
    assert(freq >= 2 /* MHz */);  // APB1 freq must be >=2 MHz
    assert(freq <= 50 /* MHz */); // APB1 freq must be <=50 MHz

    // Speed > 100 kbps require duty-cycle = 16/9
    if (pI2CHandle->config.scl_freq > I2C_FREQ_SM)
    {
        assert(pI2CHandle->config.FM_DutyCycle == I2C_DC_16_9);
    }

    // 10-bit addressing and dual addressing must not be enabled simultaneously
    assert(!(pI2CHandle->config.enable_10_bit_address &&
             pI2CHandle->config.enable_dual_address));

    // Write the APB1 clock frequency
    pI2CHandle->pI2Cx->CR2 &= ~(0b111111 << I2C_CR2_FREQ);
    pI2CHandle->pI2Cx->CR2 |= freq << I2C_CR2_FREQ;

    // Enable the ACK control
    pI2CHandle->pI2Cx->CR1 |= pI2CHandle->config.ack_enable << I2C_CR1_ACK;

    // Enable the 16/9 duty-cycle for speeds greater than 100 kbps
    if (pI2CHandle->config.scl_freq <= I2C_FREQ_SM)
    {
        // 1/2 duty cycle
        pI2CHandle->pI2Cx->CCR &= ~(1 << I2C_CCR_DUTY);
    }
    else
    {
        // 9/16 duty cycle
        pI2CHandle->pI2Cx->CCR |= 1 << I2C_CCR_DUTY;
    }

    // Write the clock control register
    pI2CHandle->pI2Cx->CCR |= I2C_CCR(freq, pI2CHandle->config.scl_freq,
                                      pI2CHandle->config.FM_DutyCycle);

    // Set the device address
    if (pI2CHandle->config.enable_10_bit_address)
    {
        // 10-bit address
        pI2CHandle->pI2Cx->OAR1 |= 1 << I2C_OAR1_ADDMODE;
        pI2CHandle->pI2Cx->OAR1 |= (pI2CHandle->config.address & 0x3FF)
                                   << I2C_OAR1_ADD0;
    }
    else
    {
        // 7-bit address
        pI2CHandle->pI2Cx->OAR1 &= ~(1 << I2C_OAR1_ADDMODE);
        pI2CHandle->pI2Cx->OAR1 |= (pI2CHandle->config.address & 0x7F)
                                   << I2C_OAR1_ADD71;
    }

    // This bit must be set ALWAYS, no apparent reason
    pI2CHandle->pI2Cx->OAR1 |= 1 << I2C_OAR1_KEEP1;

    // Enable dual address
    if (pI2CHandle->config.enable_dual_address)
    {
        // Dual address
        pI2CHandle->pI2Cx->OAR2 |= 1 << I2C_OAR2_ENDUAL;
        pI2CHandle->pI2Cx->OAR2 |= (pI2CHandle->config.address2 & 0x7F)
                                   << I2C_OAR2_ENDUAL;
    }
    else
    {
        // Regular address
        pI2CHandle->pI2Cx->OAR2 &= ~(1 << I2C_OAR2_ENDUAL);
        pI2CHandle->pI2Cx->OAR2 &= ~(0x7F << I2C_OAR2_ENDUAL);
    }

