JoseAmador95/stm32f401re/src/stm32f401-i2c-driver.c
    pI2CHandle->pI2Cx->TRISE &= ~(0b111111);
    pI2CHandle->pI2Cx->TRISE |= I2C_TRISE_Max(pI2CHandle->config.scl_freq);
}

static uint16_t I2C_CCR(uint8_t apb_freq, uint32_t scl_freq, I2C_FM_DC dc)
{
    uint32_t scl_period; // Desired SCL period
    uint32_t CCR;        // APB-to-SCL ratio
    // MHz (1e6) (Frequency) to nanoseconds (1e-9) (Period)
    uint32_t apb_period = 1000U / apb_freq;
    if (scl_freq <= I2C_FREQ_SM)
    {
        // Standard mode
        // Hz (frequency) to nanoseconds (1e-9) (period)
        scl_period = 1000000000U / scl_freq;
        CCR = (scl_period / 2) / apb_period;
    }
    else
    {
        // Fast mode
        uint8_t duty_h, duty_l;
        scl_period = 1000000000U / scl_freq;

        if (dc == I2C_DC_2)
        {
            // 50% Duty cycle
            duty_l = 2;
            duty_h = 1;
        }
        else
        {
            // 9/16 Duty cycle
            duty_l = 16;
            duty_h = 9;
        }

        CCR = scl_freq / (duty_l + duty_h) / apb_period;
    }

    return CCR & 0x7FF;
}

void I2C_Deinit(I2C_Handle_t *pI2CHandle)
{
    if (pI2CHandle->pI2Cx == I2C1)
    {
        I2C1_REG_RESET();
    }
    else if (pI2CHandle->pI2Cx == I2C2)
    {
        I2C2_REG_RESET();
    }
    else if (pI2CHandle->pI2Cx == I2C3)
    {
        I2C3_REG_RESET();
    }
}

void I2C_IRQ_Interrupt_Config(I2C_IRQ irq_number, uint8_t status)
{
    NVIC_IRQ_Interrupt_Config(irq_number, status);
}

void I2C_IRQ_Priority_Config(I2C_IRQ irq_number, uint32_t priority)
{
    NVIC_IRQ_Priority_Config(irq_number, priority);
}

void I2C_Peripheral_Control(I2C_Handle_t *pI2CHandle, uint8_t EnOrDi)
{
    if (EnOrDi == ENABLE)
    {
        pI2CHandle->pI2Cx->CR1 |= 1 << I2C_CR1_PE;
    }
    else
    {
        pI2CHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_PE);
    }
}

void I2C_Address_Phase(typedef_I2C_t *pI2Cx, uint16_t slave_address, RW rw)
{
    uint32_t temp = slave_address << 1;
    if (rw == WRITE)
    {
        temp &= ~(1);
    }
    else
    {
        temp |= 1;
    }
    pI2Cx->DR = temp;
}

void I2C_ACK_Status(typedef_I2C_t *pI2Cx, uint8_t status)
{
    if (status == ENABLE)
    {
        pI2Cx->CR1 |= 1 << I2C_CR1_ACK;
    }
    else
    {
        pI2Cx->CR1 &= ~(1 << I2C_CR1_ACK);
    }
}

/**
 * @brief Clears the ADDR bit in the ADDR bit in Status Register 1
 * @param[in] pI2Cx Pointer to a I2C perihperal
 */
void I2C_Clear_ADDR_Flag(I2C_Handle_t *pI2CHandle)
{
    uint32_t dummy;
    // Check for device role
    if (I2C_Get_Device_Role(pI2CHandle->pI2Cx) == I2C_ROLE_MASTER)
    {
        if (pI2CHandle->i2c_status == I2C_STATUS_BUSY_RX)
        {
            if (pI2CHandle->length_rx == 1)
            {
                I2C_ACK_Status(pI2CHandle->pI2Cx, DISABLE);
                dummy = pI2CHandle->pI2Cx->SR1;
                dummy = pI2CHandle->pI2Cx->SR2;
                (void)dummy;
            }
        }
        else
        {
            dummy = pI2CHandle->pI2Cx->SR1;
            dummy = pI2CHandle->pI2Cx->SR2;
            (void)dummy;
        }
    }
    else
    {
        dummy = pI2CHandle->pI2Cx->SR1;
        dummy = pI2CHandle->pI2Cx->SR2;
        (void)dummy;
    }
}

void I2C_Master_Receive_BLOCK(I2C_Handle_t *pI2CHandle, uint16_t slave_address,
                              uint8_t *buffer, uint16_t length,
                              uint8_t release_bus)
{
    // Generate the start condition
    I2C_Generate_Start_Condition(pI2CHandle->pI2Cx);

    // Wait until the start condition bit is set
    I2C_Wait_For_Flag(pI2CHandle->pI2Cx, I2C_FLAG_SB);

    // Write the source address + r/nw bit
    I2C_Address_Phase(pI2CHandle->pI2Cx, slave_address, READ);

    // Wait for the address to be acknowledged
    I2C_Wait_For_Flag(pI2CHandle->pI2Cx, I2C_FLAG_ADDR);

    // Receive the data
    if (length == 1)
    {
        I2C_ACK_Status(pI2CHandle->pI2Cx, DISABLE);
        I2C_Clear_ADDR_Flag(pI2CHandle);

        I2C_Wait_For_Flag(pI2CHandle->pI2Cx, I2C_FLAG_RXNE);

        if (release_bus)
        {
            I2C_Generate_Stop_Condition(pI2CHandle->pI2Cx);
        }

        *buffer = pI2CHandle->pI2Cx->DR;
    }
    else if (length > 1)
    {
        I2C_Clear_ADDR_Flag(pI2CHandle);

        for (uint32_t i = length; i > 0; --i)
        {
            I2C_Wait_For_Flag(pI2CHandle->pI2Cx, I2C_FLAG_RXNE);

            if (i == 2)
            {
                I2C_ACK_Status(pI2CHandle->pI2Cx, DISABLE);

                if (release_bus)
                {
                    I2C_Generate_Stop_Condition(pI2CHandle->pI2Cx);
                }
            }

            *(buffer++) = pI2CHandle->pI2Cx->DR;
        }
    }

    I2C_ACK_Status(pI2CHandle->pI2Cx,
                   pI2CHandle->config.ack_enable == I2C_ACK_ENABLE);
}

void I2C_Master_Send_BLOCK(I2C_Handle_t *pI2CHandle, uint16_t slave_address,
                           uint8_t *buffer, uint16_t length,
                           uint8_t release_bus)
{
    // Generate Start Conditon
    I2C_Generate_Start_Condition(pI2CHandle->pI2Cx);

    // Wait until the Start condition bit is set
    I2C_Wait_For_Flag(pI2CHandle->pI2Cx, I2C_FLAG_SB);

    // Write the destination address + r/nw bit
    I2C_Address_Phase(pI2CHandle->pI2Cx, slave_address, WRITE);

    // Wait until the address is acknowledged
    I2C_Wait_For_Flag(pI2CHandle->pI2Cx, I2C_FLAG_ADDR);

    uint32_t dummy = pI2CHandle->pI2Cx->SR2; // Read SR2 to clear ADDR
    (void)dummy;

    while (length > 0)
    {
        // Wait for the Tx buffer to empty
        I2C_Wait_For_Flag(pI2CHandle->pI2Cx, I2C_FLAG_TXE);

        // Send data
        pI2CHandle->pI2Cx->DR = *(buffer++);
        length--;
    }

    I2C_Wait_For_Flag(pI2CHandle->pI2Cx, I2C_FLAG_TXE);
    I2C_Wait_For_Flag(pI2CHandle->pI2Cx, I2C_FLAG_BTF);

    if (release_bus)
    {
        I2C_Generate_Stop_Condition(pI2CHandle->pI2Cx);
    }
}

uint8_t I2C_Master_Receive_IT(I2C_Handle_t *pI2CHandle, uint16_t slave_address,
                              uint8_t *buffer, uint16_t length,
                              uint8_t release_bus)
{
    I2C_STATUS i2c_status = pI2CHandle->i2c_status;

    if (i2c_status == I2C_STATUS_READY)
    {
        pI2CHandle->buffer_rx = buffer;
        pI2CHandle->length_rx = length;
        pI2CHandle->i2c_status = I2C_STATUS_BUSY_RX;
        pI2CHandle->device_address = slave_address;
        pI2CHandle->release_bus = release_bus;

        // Generate start condition
        I2C_Generate_Start_Condition(pI2CHandle->pI2Cx);

        // Enable the I2C interrupts for handling data flow
        pI2CHandle->pI2Cx->CR2 |= 1 << I2C_CR2_ITBUFEN;

        // Enable the I2C interrupts for handling the I2C events
        pI2CHandle->pI2Cx->CR2 |= 1 << I2C_CR2_ITEVTEN;

        // Enable the I2C interrupts for handling I2C errors
        pI2CHandle->pI2Cx->CR2 |= 1 << I2C_CR2_ITERREN;
    }

