JoseAmador95/stm32f401re/src/stm32f401-i2c-driver.c
    return i2c_status == I2C_STATUS_READY;
}

uint8_t I2C_Master_Send_IT(I2C_Handle_t *pI2CHandle, uint16_t slave_address,
                           uint8_t *buffer, uint16_t length,
                           uint8_t release_bus)
{
    I2C_STATUS i2c_status = pI2CHandle->i2c_status;

    if (i2c_status == I2C_STATUS_READY)
    {
        pI2CHandle->buffer_tx = buffer;
        pI2CHandle->length_tx = length;
        pI2CHandle->i2c_status = I2C_STATUS_BUSY_TX;
        pI2CHandle->device_address = slave_address;
        pI2CHandle->release_bus = release_bus;

        // Generate start condition
        I2C_Generate_Start_Condition(pI2CHandle->pI2Cx);

        // Enable the I2C interrupts for handling data flow
        pI2CHandle->pI2Cx->CR2 |= 1 << I2C_CR2_ITBUFEN;

        // Enable the I2C interrupts for handling the I2C events
        pI2CHandle->pI2Cx->CR2 |= 1 << I2C_CR2_ITEVTEN;

        // Enable the I2C interrupts for handling I2C errors
        pI2CHandle->pI2Cx->CR2 |= 1 << I2C_CR2_ITERREN;
    }

    return i2c_status == I2C_STATUS_READY;
}

uint8_t I2C_Master_Receive(I2C_Handle_t *pI2CHandle, uint16_t slave_address,
                           uint8_t *buffer, uint16_t length,
                           uint8_t release_bus)
{
#ifdef I2C_API_BLOCKING
    I2C_Master_Receive_BLOCK(pI2CHandle, slave_address, buffer, length,
                             release_bus);
    return 0;
#else
    return I2C_Master_Receive_IT(pI2CHandle, slave_address, buffer, length,
                                 release_bus);
#endif
}

uint8_t I2C_Master_Send(I2C_Handle_t *pI2CHandle, uint16_t slave_address,
                        uint8_t *buffer, uint16_t length, uint8_t release_bus)
{
#ifdef I2C_API_BLOCKING
    I2C_Master_Send_BLOCK(pI2CHandle, slave_address, buffer, length,
                          release_bus);
    return 0;
#else
    return I2C_Master_Send_IT(pI2CHandle, slave_address, buffer, length,
                              release_bus);
#endif
}

void I2C_EV_Handler(I2C_Handle_t *pI2CHandle)
{
    // Check if the event interrupts are enabled
    uint8_t i2c_ev_int_enabled =
        (uint32_t)(pI2CHandle->pI2Cx->CR2 & (1 << I2C_CR2_ITEVTEN)) != 0;

    // Check if the buffer interrupts are enabled
    uint8_t i2c_buff_int_enabled =
        (uint32_t)(pI2CHandle->pI2Cx->CR2 & (1 << I2C_CR2_ITBUFEN)) != 0;

    // Check if this handler should have been triggered
    if (!i2c_ev_int_enabled)
    {
        // Exit as the interrupts are not enabled
        return;
    }

    if (I2C_Get_Flag_Status(pI2CHandle->pI2Cx, I2C_FLAG_SB))
    {
        // I2C Start Condition detected
        // Next step: Execute address phase
        RW operation;
        if (pI2CHandle->i2c_status == I2C_STATUS_BUSY_TX)
        {
            operation = WRITE;
        }
        else if (pI2CHandle->i2c_status == I2C_STATUS_BUSY_RX)
        {
            operation = READ;
        }

        I2C_Address_Phase(pI2CHandle->pI2Cx, pI2CHandle->device_address,
                          operation);
    }

    if (I2C_Get_Flag_Status(pI2CHandle->pI2Cx, I2C_FLAG_ADDR))
    {
        // I2C Address ack detected
        // Next Step: Clear the ADDR bit
        // The R/W operations are handled after the Byte Transfer is finished
        I2C_Clear_ADDR_Flag(pI2CHandle);
    }

    if (I2C_Get_Flag_Status(pI2CHandle->pI2Cx, I2C_FLAG_BTF))
    {
        // An I2C transfer has been completed
        if (pI2CHandle->i2c_status == I2C_STATUS_BUSY_TX)
        {
            // I2C device is in transmission mode
            if (I2C_Get_Flag_Status(pI2CHandle->pI2Cx, I2C_FLAG_TXE))
            {
                // TX buffer is empy
                // I2C peripheral may have completed transmission
                if (pI2CHandle->length_tx == 0)
                {
                    // Transmission is completed
                    // The I2C peripheral will be reset for the next transfer

                    // Generate a stop condition
                    if (pI2CHandle->release_bus)
                    {
                        I2C_Generate_Stop_Condition(pI2CHandle->pI2Cx);
                    }

                    // Reset I2C Handler to default state
                    I2C_Close(pI2CHandle, DISABLE);

                    // Notify the application about tx complete
                    I2C_Application_EV_Callback(pI2CHandle,
                                                I2C_APP_EV_TX_COMPLETE);
                }
            }
        }
        else
        {
            // Nothing to do if RXNE is set
        }
    }

    if (I2C_Get_Flag_Status(pI2CHandle->pI2Cx, I2C_FLAG_STOPF))
    {
        // The STOPF bit is only used in slave mode

        // Clear the STOPF flag
        pI2CHandle->pI2Cx->CR1 |= 0;

        I2C_Application_EV_Callback(pI2CHandle, I2C_APP_EV_STOP);
    }

    // if the buffer interrupts are enabled
    if (i2c_buff_int_enabled)
    {
        // If the TXE flag is enabled
        if (I2C_Get_Flag_Status(pI2CHandle->pI2Cx, I2C_FLAG_TXE))
        {
            // If the device is master
            if (I2C_Get_Device_Role(pI2CHandle->pI2Cx) == I2C_ROLE_MASTER)
            {
                // If the master device is transmitting
                if (pI2CHandle->i2c_status == I2C_STATUS_BUSY_TX)
                {
                    // If there are pending bytes to transfer
                    if (pI2CHandle->length_tx)
                    {
                        pI2CHandle->pI2Cx->DR = *(pI2CHandle->buffer_tx++);
                        pI2CHandle->length_tx--;
                    }
                }
            }
        }

        // If the RXNE flag is enabled
        if (I2C_Get_Flag_Status(pI2CHandle->pI2Cx, I2C_FLAG_RXNE))
        {
            // If the device is I2C master
            if (I2C_Get_Device_Role(pI2CHandle->pI2Cx) == I2C_ROLE_MASTER)
            {
                // If the device is busy in RX
                if (pI2CHandle->i2c_status == I2C_STATUS_BUSY_RX)
                {
                    if (pI2CHandle->length_rx == 1)
                    {
                        *(pI2CHandle->buffer_rx++) = pI2CHandle->pI2Cx->DR;
                        pI2CHandle->length_rx--;
                    }
                    else if (pI2CHandle->length_rx > 1)
                    {
                        if (pI2CHandle->length_rx == 2)
                        {
                            I2C_ACK_Status(pI2CHandle->pI2Cx, DISABLE);
                        }

                        *(pI2CHandle->buffer_rx++) = pI2CHandle->pI2Cx->DR;
                        pI2CHandle->length_rx--;
                    }
                    else if (pI2CHandle->length_rx == 0)
                    {
                        I2C_Generate_Stop_Condition(pI2CHandle->pI2Cx);

                        I2C_Close(pI2CHandle, DISABLE);

