JoseAmador95/stm32f401re/src/stm32f401-i2c-driver.c
                        I2C_Application_EV_Callback(pI2CHandle,
                                                    I2C_APP_EV_RX_COMPLETE);
                    }
                }
            }
        }
    }
}

void I2C_ERR_Handler(I2C_Handle_t *pI2CHandle)
{
    if ((pI2CHandle->pI2Cx->CR2 & (1 << I2C_CR2_ITERREN)) == 0)
    {
        // Error interrupts are not enabled
        return;
    }

    // Bus error
    if (I2C_Get_Error_Status(pI2CHandle->pI2Cx, I2C_ERROR_BERR))
    {
        pI2CHandle->pI2Cx->SR1 &= ~(1 << I2C_SR1_BERR);

        I2C_Application_EV_Callback(pI2CHandle, I2C_APP_ERROR_BERR);
    }

    // Arbitration Lost error
    if (I2C_Get_Error_Status(pI2CHandle->pI2Cx, I2C_ERROR_ARLO))
    {
        pI2CHandle->pI2Cx->SR1 &= ~(1 << I2C_SR1_ARLO);

        I2C_Application_EV_Callback(pI2CHandle, I2C_APP_ERROR_ARLO);
    }

    // Acknowledgement Failed error
    if (I2C_Get_Error_Status(pI2CHandle->pI2Cx, I2C_ERROR_AF))
    {
        pI2CHandle->pI2Cx->SR1 &= ~(1 << I2C_SR1_AF);

        I2C_Application_EV_Callback(pI2CHandle, I2C_APP_ERROR_AF);
    }

    // Overrun/Underrun error
    if (I2C_Get_Error_Status(pI2CHandle->pI2Cx, I2C_ERROR_OVR))
    {
        pI2CHandle->pI2Cx->SR1 &= ~(1 << I2C_SR1_OVR);

        I2C_Application_EV_Callback(pI2CHandle, I2C_APP_ERROR_OVR);
    }

    // Timeout error
    if (I2C_Get_Error_Status(pI2CHandle->pI2Cx, I2C_ERROR_TIMEOUT))
    {
        pI2CHandle->pI2Cx->SR1 &= ~(1 << I2C_SR1_TIMEOUT);

        I2C_Application_EV_Callback(pI2CHandle, I2C_APP_ERROR_TIMEOUT);
    }
}

static void I2C_Generate_Start_Condition(typedef_I2C_t *pI2Cx)
{
    pI2Cx->CR1 |= 1 << I2C_CR1_START;
}

static void I2C_Generate_Stop_Condition(typedef_I2C_t *pI2Cx)
{
    pI2Cx->CR1 |= 1 << I2C_CR1_STOP;
}

static uint8_t I2C_Get_Flag_Status(typedef_I2C_t *pI2Cx, I2C_STATUS_FLAGS flag)
{
    uint8_t status;

    switch (flag)
    {
    case I2C_FLAG_SB: // Start Bit ocurred
        status = (pI2Cx->SR1 >> I2C_SR1_SB) & 0x01;
        break;
    case I2C_FLAG_ADDR: // Address matched
        status = (pI2Cx->SR1 >> I2C_SR1_ADDR) & 0x01;
        break;
    case I2C_FLAG_TXE: // TX buffer empty
        status = (pI2Cx->SR1 >> I2C_SR1_TXE) & 0x01;
        break;
    case I2C_FLAG_RXNE: // RX buffer not empty
        status = (pI2Cx->SR1 >> I2C_SR1_RXNE) & 0x01;
        break;
    case I2C_FLAG_BTF: // Byte transfer finished
        status = (pI2Cx->SR1 >> I2C_SR1_BTF) & 0x01;
        break;
    case I2C_FLAG_BUSY: // Bus busy
        status = (pI2Cx->SR2 >> I2C_SR2_BUSY) & 0x01;
        break;
    case I2C_FLAG_ADD10:
        status = (pI2Cx->SR1 >> I2C_SR1_ADD10) & 0x01;
        break;
    case I2C_FLAG_STOPF:
        status = (pI2Cx->SR1 >> I2C_SR1_STOPF) & 0x01;
        break;
    case I2C_FLAG_MSL:
        status = (pI2Cx->SR2 >> I2C_SR2_MSL) & 0x01;
        break;
    case I2C_FLAG_TRA:
        status = (pI2Cx->SR2 >> I2C_SR2_TRA) & 0x01;
        break;
    case I2C_FLAG_GEN_CALL:
        status = (pI2Cx->SR2 >> I2C_SR2_GENCALL) & 0x01;
        break;
    case I2C_FLAG_SMB_HOST:
    case I2C_FLAG_SMBDE_FAULT:
    case I2C_FLAG_DUALF:
    case I2C_FLAG_PEC:
    default:
        break;

    }

    return status;
}

static uint8_t I2C_Get_Error_Status(typedef_I2C_t *pI2Cx, I2C_ERROR_FLAGS flag)
{
    return pI2Cx->SR1 & (1 << (uint8_t)flag);
}

static uint8_t I2C_TRISE_Max(uint32_t scl_freq)
{
    const uint32_t apb_freq = RCC_get_apb1_freq();
    const uint32_t apb_period =
        NANOSECONDS / apb_freq; // apb freq in nanoseconds

    // Max SCL rise time for SM or FM, respectively (in nanoseconds)
    const uint16_t max_Trise =
        (scl_freq <= I2C_FREQ_SM) ? I2C_MAX_TRISE_SM : I2C_MAX_TRISE_FM;

    // Compute the TRISE bits using the formula
    uint8_t TRISE = max_Trise / apb_period;

    // Return 5 bits of TRISE+1 (required by the reference manual)
    return (TRISE + 1) & 0x1F;
}

static I2C_ROLE I2C_Get_Device_Role(typedef_I2C_t *pI2Cx)
{
    if (pI2Cx->SR2 & (1 << I2C_SR2_MSL))
    {
        return I2C_ROLE_MASTER;
    }
    else
    {
        return I2C_ROLE_SLAVE;
    }
}

void I2C_Close(I2C_Handle_t *pI2CHandle, uint8_t stop_transfer)
{
    // Disabel interrupts for events and buffer
    pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_ITEVTEN);
    pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_ITBUFEN);

    if (pI2CHandle->i2c_status == I2C_STATUS_BUSY_TX)
    {
        pI2CHandle->buffer_tx = NULL;
        pI2CHandle->length_tx = 0;
    }
    else if (pI2CHandle->i2c_status == I2C_STATUS_BUSY_RX)
    {
        pI2CHandle->buffer_rx = NULL;
        pI2CHandle->length_rx = 0;
        if (pI2CHandle->config.ack_enable == I2C_ACK_ENABLE)
        {
            I2C_ACK_Status(pI2CHandle->pI2Cx, ENABLE);
        }
    }

    pI2CHandle->i2c_status = I2C_STATUS_READY;
    pI2CHandle->release_bus = ENABLE;

    if (stop_transfer)
    {
        I2C_Generate_Start_Condition(pI2CHandle->pI2Cx);
    }
}

__weak void I2C_Application_EV_Callback(I2C_Handle_t *pI2CHandle, I2C_APP flag)
{
    // Weak implementation
}